app/controllers/registrations_controller.rb

	def create
	    #complete this method
		@uid = User.last.uid + 1
		@user = User.create(uid: @uid, user_params)
---
INSERT INTO "users" ("name", "last_name", "phone", "address", "created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?, ?, ?)